Simplify current doc
